___

<a href='http://www.pieriandata.com'> <img src='../../Pierian_Data_Logo.png' /></a>
___

# SF Salaries Exercise 

Welcome to a quick exercise for you to practice your pandas skills! We will be using the [SF Salaries Dataset](https://www.kaggle.com/kaggle/sf-salaries) from Kaggle! Just follow along and complete the tasks outlined in bold below. The tasks will get harder and harder as you go along.

** Import pandas as pd.**

In [1]:
import pandas as pd
import numpy as np

** Read Salaries.csv as a dataframe called sal.**

In [2]:
sal = pd.read_csv('Salaries.csv')

** Check the head of the DataFrame. **

In [3]:
sal.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

** Use the .info() method to find out how many entries there are.**

In [6]:
sal.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
Id                  148654 non-null int64
EmployeeName        148654 non-null object
JobTitle            148654 non-null object
BasePay             148045 non-null float64
OvertimePay         148650 non-null float64
OtherPay            148650 non-null float64
Benefits            112491 non-null float64
TotalPay            148654 non-null float64
TotalPayBenefits    148654 non-null float64
Year                148654 non-null int64
Notes               0 non-null float64
Agency              148654 non-null object
Status              0 non-null float64
dtypes: float64(8), int64(2), object(3)
memory usage: 14.7+ MB

**What is the average BasePay ?**

In [7]:
sal['BasePay'].mean()

66325.44884050643

** What is the highest amount of OvertimePay in the dataset ? **

In [8]:
sal['OvertimePay'].max()

245131.88

In [23]:
sal['Id'].count()

148654

** What is the job title of  JOSEPH DRISCOLL ? Note: Use all caps, otherwise you may get an answer that doesn't match up (there is also a lowercase Joseph Driscoll). **

In [29]:
def findJobTitle(df, name):
    count = 0   
    for count in range (0, df['Id'].count()):
        if df.loc[count, 'EmployeeName'] == name:
            return df.loc[count, 'JobTitle']
        else:
            count= count +1

In [30]:
askName = 'JOSEPH DRISCOLL'
print('Job Title for {} is {}'.format(askName,findJobTitle(sal, askName)))

Job Title for JOSEPH DRISCOLL is CAPTAIN, FIRE SUPPRESSION

In [35]:
sal[sal['EmployeeName']=='JOSEPH DRISCOLL']['JobTitle']

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

** How much does JOSEPH DRISCOLL make (including benefits)? **

In [36]:
sal[sal['EmployeeName']=='JOSEPH DRISCOLL']['TotalPayBenefits']

24    270324.91
Name: TotalPayBenefits, dtype: float64

** What is the name of highest paid person (including benefits)?**

In [47]:
sal[sal['TotalPayBenefits']==sal['TotalPayBenefits'].max()]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN

** What is the name of lowest paid person (including benefits)? Do you notice something strange about how much he or she is paid?**

In [48]:
sal[sal['TotalPayBenefits']==sal['TotalPayBenefits'].min()]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.0,0.0,-618.13,0.0,-618.13,-618.13,2014,NaN,San Francisco,NaN

** What was the average (mean) BasePay of all employees per year? (2011-2014) ? **

In [51]:
byYear=sal.groupby('Year')

In [53]:
byYear['BasePay'].mean()

Year
2011    63595.956517
2012    65436.406857
2013    69630.030216
2014    66564.421924
Name: BasePay, dtype: float64

In [55]:
byYear.describe()

      BasePay                                                           \
        count          mean           std     min        25%       50%
Year
2011  36159.0  63595.956517  40556.774993    0.00  33468.125  62871.72
2012  36766.0  65436.406857  41782.209797 -166.01  34036.580  64017.37
2013  37001.0  69630.030216  44237.113207   15.83  37021.500  67669.00
2014  38119.0  66564.421924  44053.783972    0.00  30138.055  65055.00

                            Benefits                  ...        TotalPay  \
             75%        max    count          mean    ...             75%
Year                                                  ...
2011  90649.7650  294580.02      0.0           NaN    ...      102512.680
2012  92427.9275  302578.00  36766.0  26439.966967    ...      104099.170
2013  98272.5500  319275.01  37606.0  23829.076572    ...      109637.670
2014  94735.0500  318835.49  38119.0  24789.601756    ...      107974.445

                TotalPayBenefits                                       \
            max            count           mean           std     min
Year
2011  567595.43          36159.0   71744.103871  47498.706594    0.00
2012  362844.66          36766.0  100553.229232  63555.796681    1.91
2013  347102.32          37606.0  101440.519714  66390.034642  -33.89
2014  471952.64          38123.0  100250.918884  66238.852887 -618.13


             25%         50%          75%        max
Year
2011  36810.7600   68213.240  102512.6800  567595.43
2012  51743.0925  101751.290  142396.3325  407274.78
2013  48259.6000  101969.445  142793.6875  425815.28
2014  44199.9900  101105.370  142746.9500  510732.68

[4 rows x 72 columns]

In [65]:
byYear['JobTitle'].count()

Year
2011    36159
2012    36766
2013    37606
2014    38123
Name: JobTitle, dtype: int64

** How many unique job titles are there? **

In [57]:
sal['JobTitle'].nunique()

2159

** What are the top 5 most common jobs? **

In [60]:
sal['JobTitle'].value_counts()

Transit Operator                                    7036
Special Nurse                                       4389
Registered Nurse                                    3736
Public Svc Aide-Public Works                        2518
Police Officer 3                                    2421
Custodian                                           2418
TRANSIT OPERATOR                                    2388
Firefighter                                         2359
Recreation Leader                                   1971
Patient Care Assistant                              1945
Deputy Sheriff                                      1933
Police Officer                                      1476
SPECIAL NURSE                                       1402
Public Service Trainee                              1328
REGISTERED NURSE                                    1219
Police Officer 2                                    1141
Attorney (Civil/Criminal)                           1126
Porter                                              1095
Sergeant 3                                          1047
General Laborer                                     1033
EMT/Paramedic/Firefighter                            918
Gardener                                             894
Parking Control Officer                              868
Senior Clerk                                         840
Library Page                                         799
CUSTODIAN                                            796
FIREFIGHTER                                          794
POLICE OFFICER III                                   779
Clerk                                                764
Eligibility Worker                                   760
                                                    ...
LEGISLATIVE ASSISTANT, CITY ATTORNEY'S OFFICE          1
ANIMAL CARE ASSISTANT SUPERVISOR                       1
ASSISTANT INDUSTRIAL HYGIENIST                         1
TRAF SIGNAL ELECTRICIAN SUP I                          1
AIRPORT MECHANICAL MAINTENANCE SUPERVISOR              1
MEDIA/SECURITY SYSTEMS SUPERVISOR                      1
Drug Court Coordinator                                 1
ASSOCIATE MUSEUM CONSERVATOR, ASIAN ART MUSEUM         1
CRANE MECHANIC SUPERVISOR                              1
ASSISTANT COURT REPORTER COORDINATOR                   1
SENIOR MAINTENANCE CONTROLLER                          1
EXECUTIVE DIRECTOR, SOUTHEAST COMMUNITY FACILITY       1
SECRETARY, COMMISSION ON THE ENVIRONMENT               1
TELECOMMUNICATIONS TECHNICIAN SUPERVISOR               1
Public Service Aide-Technical                          1
PIANIST                                                1
Sr Cnselor, Juv Hall (SFERS)                           1
ELECTROENCEPHALOGRAPH TECHNICIAN I                     1
LEGISLATION CLERK                                      1
ASSISTANT RECREATION SUPERVISOR                        1
HEAD PHOTOGRAPHER                                      1
TRAFFIC HEARING OFFICER                                1
ASSISTANT INSPECTOR (POLICE DEPARTMENT)                1
DEPUTY DIRECTOR OF INVESTMENTS                         1
HUMAN RESOURCES DIRECTOR                               1
PAINTER SUPERVISOR II                                  1
CHIEF PROBATION OFFICER, JUVENILE COURT                1
METAL FABRICATOR                                       1
TREE TOPPER SUPERVISOR II                              1
MARKET RESEARCH SPECIALISTS, PORT                      1
Name: JobTitle, Length: 2159, dtype: int64

In [3]:
sal['JobTitle'].value_counts().head(5)

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: JobTitle, dtype: int64

** How many Job Titles were represented by only one person in 2013? (e.g. Job Titles with only one occurence in 2013?) **

In [70]:
sum(sal[sal['Year']==2013]['JobTitle'].value_counts() == 1)

202

** How many people have the word Chief in their job title? (This is pretty tricky) **

In [26]:
def chkWord(df):
    numChief = 0
    for item in range(0,df['Id'].count()):
        str = df.loc[item,'JobTitle'].lower()
        if 'chief' in str:
            numChief = numChief + 1
return numChief

SyntaxError: 'return' outside function (<ipython-input-26-4645912fce27>, line 7)

In [17]:
chkWord(sal)

627

In [18]:
def chief_string(title):
    if 'chief' in title.lower():
        return True
    else:
        return False

In [19]:
sum(sal['JobTitle'].apply(lambda x: chief_string(x)))

627

** Bonus: Is there a correlation between length of the Job Title string and Salary? **

In [20]:
sal['title_len'] = sal['JobTitle'].apply(len)

In [25]:
sal[['title_len', 'TotalPayBenefits']].corr()

                  title_len  TotalPayBenefits
title_len          1.000000         -0.036878
TotalPayBenefits  -0.036878          1.000000

# Great Job!